#REALIZAMOS CONEXION DE PYTHON CON BASE DE DATOS SAKILA

In [1]:
pip show sqlalchemy | grep Version

Version: 2.0.46
Note: you may need to restart the kernel to use updated packages.

In [2]:
%pip install pymysql
!pip install --upgrade sqlalchemy

Requirement already satisfied: pymysql in /opt/anaconda3/lib/python3.13/site-packages (1.1.2)
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: sqlalchemy in /opt/anaconda3/lib/python3.13/site-packages (2.0.46)
Requirement already satisfied: typing-extensions>=4.6.0 in /opt/anaconda3/lib/python3.13/site-packages (from sqlalchemy) (4.15.0)

In [3]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine
import getpass  # To get the password without showing the input
password = getpass.getpass()

In [4]:
bd = "sakila"
connection_string = 'mysql+pymysql://root:' + password + '@localhost/'+bd
engine = create_engine(connection_string)
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

#CREAMOS LA FUNCION PARA ACCEDER A LOS ALQUILERES MENSUALES#

In [5]:
def rentals_month(engine, month, year):
    query = f"""
        SELECT *
        FROM rental
        WHERE MONTH(rental_date) = {month}
          AND YEAR(rental_date) = {year}
    """
    
    df = pd.read_sql(query, engine)
    return df

##CREAMOS LA FUNCION PARA ACCEDER A LOS ALQUILERES DEL MES DE MAYO, TAL COMO EL EJEMPLO MENCIONADO EN EL EJERCICIO

In [6]:
may_rentals = rentals_month(engine, 5, 2005)
may_rentals.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [7]:
may_rentals.shape

(1156, 7)

In [8]:
def conteo_mensual_renta(df, month, year):
    column_name = f"rentals_{month:02d}_{year}"
    
    result = (
        df
        .groupby("customer_id")
        .size()
        .reset_index(name=column_name)
    )
    
    return result

In [10]:
may_counts = conteo_mensual_renta(may_rentals, 5, 2005)
may_counts.head()

   customer_id  rentals_05_2005
0            1                2
1            2                1
2            3                2
3            5                3
4            6                3

In [11]:
may_counts.shape

(520, 2)

In [ ]:
#CREAMOS LA FUNCION DE COMPARACIÓN DE RENTAS Y LA UTILIZAMOS PARA COMPARAR LA PRODUCCION DE LOS MESES DE MAYO Y JUNIO

In [12]:
def comparación_rentas(df1, df2):
    merged = pd.merge(df1, df2, on="customer_id", how="inner")
    
    col1 = df1.columns[1]
    col2 = df2.columns[1]
    
    merged["Diferencia entre meses"] = merged[col2] - merged[col1]
    
    return merged

In [14]:
jun_rentals = rentals_month(engine, 6, 2005)
jun_counts = conteo_mensual_renta(jun_rentals, 6, 2005)

In [16]:
comparacion = comparación_rentas(may_counts, jun_counts)
comparacion.head()

   customer_id  rentals_05_2005  rentals_06_2005  Diferencia entre meses
0            1                2                7                       5
1            2                1                1                       0
2            3                2                4                       2
3            5                3                5                       2
4            6                3                4                       1